//Завдання1. Створіть змінну temperature та використайте if-else для визначення, чи є погода холодною, теплою чи спекотною.

let temperature = 50;

if (temperature<10) {
    console.log("холодно");
} else if (temperature>=10 && temperature<25){
    console.log("тепло");
} else {
    console.log("спекотно");
}

//Завдання2. Реалізуйте програму, яка перевіряє, чи є число парним або непарним за допомогою тернарного оператора.

let number = 8;

let result = (number % 2 === 0) ? "Число парне" : "Число непарне";

console.log(result);

//Завдання 3. Використовуючи switch, створіть програму, яка виводить повідомлення про день тижня за його назвою.

let day = "Субота";

switch(day){
    case "Понеділок":
        console.log("Початок тижня");
        break;
    case "Вівторок":
        console.log("Другий день тижня");
        break;
    case "Середа":
        console.log("Третій день тижня");
        break;
    case "Четвер":
        console.log("Четвертий день тижня");
        break;
    case "П'ятниця":
        console.log("П'ятий день тижня");
        break;
    case "Субота":
        console.log("Шостий день тижня");
        break;
    case "Неділя":
        console.log("Кінець тижня");
        break;

    default:
        console.log("Невірно введений день");
}

//Завдання 4. Напишіть програму, яка перевіряє введений користувачем пароль:
//o Якщо пароль дорівнює “admin123”, вивести “Доступ дозволено”.
//o Якщо пароль неправильний, вивести “Доступ заборонено”.

let password = "admin456";

if (password === "admin123"){
    console.log("Доступ дозволено");
} else {
    console.log("Доступ заборонено");
}

// Додаткове завдання. 
 
/*Програма приймає оцінку студента (від 0 до 100) і виводить відповідну оцінку за шкалою:
90-100: "Відмінно"
70-89: "Добре"
50-69: "Задовільно"
0-49: "Не склав"*/

let grade = 111;

if (grade >=90 && grade <=100 ) {
    console.log("Відмінно");
} else if (grade >= 70 && grade <= 89){
    console.log("Добре");
} else if (grade >= 50 && grade <= 69){
    console.log("Задовільно");
} else if (grade >= 0 && grade <= 49){
    console.log("Не склав")
} else{
    console.log("Некоректно введена оцінка")
}

