//Завдання1. Створіть змінну temperature та використайте if-else для визначення, чи є погода холодною, теплою чи спекотною.

let tempetature = 50;

if (tempetature<10) {
    console.log("холодно");
} else if (tempetature>=10 && tempetature<25){
    console.log("тепло");
} else {
    console.log("спекотно");
}

//Завдання2. Реалізуйте програму, яка перевіряє, чи є число парним або непарним за допомогою тернарного оператора.

let number = 8;

let result = (number % 2 === 0) ? "Число парне" : "Число непарне";

console.log(result);

//Завдання 3. Використовуючи switch, створіть програму, яка виводить повідомлення про день тижня за його назвою.

let day = "Субота";

switch(day){
    case "Понеділок":
        console.log("Початок тижня");
        break;
    case "Вівторок":
        console.log("Другий день тижня");
        break;
    case "Середа":
        console.log("Третій день тижня");
        break;
    case "Четвер":
        console.log("Четвертий день тижня");
        break;
    case "П'ятниця":
        console.log("П'ятий день тижня");
        break;
    case "Субота":
        console.log("Шостий день тижня");
        break;
    case "Неділя":
        console.log("Кінець тижня");
        break;

    default:
        console.log("Невірно введений день");
}

//Завдання 4. Напишіть програму, яка перевіряє введений користувачем пароль:
//o Якщо пароль дорівнює “admin123”, вивести “Доступ дозволено”.
//o Якщо пароль неправильний, вивести “Доступ заборонено”.

let password = "admin456";

if (password === "admin123"){
    console.log("Доступ дозволено");
} else {
    console.log("Доступ заборонено");
}

